<?php 

$fractions = array(
	"-",
	"МВД",
	"Правительство",
	"Судебная Организация",
	"ГИБДД",
	"СМП",
	"Прокуратура", // ?
	"Армия",
	"-", // ?
	"Следственный комитет", // ?
	"ОПГ Курганская",
	"Гопники",
	"Таксопарк",
	"МЧС"
);
$rangs = array(
	array(), // -
	array("Рядовой", "Рядовой", "Младший сержант", "Сержант", "Старший сержант", "Старшина", "Младший лейтенант", "Лейтенант", "Старший лейтенант", "Капитан", "Майор", "Подполковник", "Полковник", "Генерал-майор"), // полиция
	array("Стажер", "Стажер", "Секретарь", "Сотрудник СБ", "Начальник СБ", "Сотрудник ОДО", "Начальник ОДО", "Юрист", "Депутат обл. думы", "Заместитель мэра", "Мэр г.Арзамас", "Мэр г.Южный", "Заместитель Губернатора", "Губернатор"), // Правительство
	array("Курсант ЦПП", "Курсант ЦПП", "Рядовой", "Мл.Сержант", "Сержант", "Ст.Сержант", "Старшина", "Прапорщик", "Мл.Лейтенант", "Ст.Лейтенант", "Капитан", "Майор", "Подполковник", "Полковник", "Генерал-майор", "Адвокат", "Руководитель", "Федеральный судья", "Зам. председателя", "Верховный судья"), // Судебка
	array("Рядовой", "Рядовой", "Младший сержант", "Сержант", "Старший сержант", "Старшина", "Младший лейтенант", "Лейтенант", "Старший лейтенант", "Капитан", "Майор", "Подполковник", "Полковник", "Генерал-майор"), // ГИБДД
	array("Практикант", "Практикант", "Водитель", "Интерн", "Диспетчер", "Психолог", "Хирург", "Нарколог", "Терапевт-Врач", "Зам.Заведующего", "Заведующий", "Зам. Глав. врача", "Глав Врач"), // СМП
	array("Юрист 3 класса", "Юрист 3 класса", "Юрист 2 класса", "Юрист 1 класса", "Мл.советник юстиции", "Советник юстиции", "Ст.советник юстиции", "Помощник прокурора", "Прокурор", "Помощник обл.Прокурора", "Областной Прокурор"), // -
	array("Рядовой", "Рядовой", "Ефрейтор", "Младший сержант", "Сержант", "Старший сержант", "Старшина", "Прапорщик", "Старший прапорщик", "Младший лейтенант", "Лейтенант", "Старший лейтенант", "Капитан", "Майор", "Подполковник", "Полковник"), // Армия
	array("Юрист 3 класса", "Юрист 2 класса", "Юрист 1 класса", "Мл.советник юстиции", "Советник юстиции", "Ст.советник юстиции", "Помощник прокурора", "Прокурор", "Помощник обл.Прокурора", "Областной Прокурор"), // -
	array("Рядовой", "Рядовой", "Младший сержант", "Сержант", "Старший сержант", "Старшина", "Младший лейтенант", "Лейтенант", "Старший лейтенант", "Капитан", "Майор", "Подполковник", "Полковник"), // -
	array("Шнырь", "Шнырь", "Барыга", "Рэкетир", "Киллер", "Бригадир", "Смотрящий", "Криминальный авторитет", "Положенец", "Вор в законе"), // ОПГ Курганская
	array("Молодой", "Молодой", "Шпана", "Гопник", "Хулиган", "Блатной", "Смотрящий за районом", "Авторитет", "Пахан"), // Гопники
	array("Практикант", "Практикант", "Таксист 3 класса", "Таксист 2 класса", "Таксист 1 класса", "Диспетчер", "Руководитель", "Зам. директора", "Директор"), // Таксопарк
	array("Рядовой", "Рядовой", "Мл. сержант", "Сержант", "Ст. Сержант", "Старшина", "Прапорщик", "Ст. Прапорщик", "Мл. Лейтенант", "Лейтенант", "Ст. Лейтенант", "Капитан", "Майор", "Подполковник", "Полковник") // МЧС
);
$sub_rangs = array(
	array(),
	array("ППС", "ППС", "ОМОН", "СО", "ОРО"), // Полиция
	array(), // Правительство
	array("ФСИН", "ФСИН", "СУД", "Адвокатура"), // Судебка
	array("ОБ", "ОБ", "СБ", "СЭ", "МРЭО", "СР-ДПС", "СЭ-ДПС", "Мото-Рота", "ЦППС"), // ГИБДД
	array("СМП", "СМП", "ХО", "НО"), // СМП
	array(), // -
	array("1-ая рота", "ВАИ", "1-ая рота", "2-ая рота", "РСПН", "Мед.Часть"), // Армия
	array(), // -
	array(), // -
	array(), // ОПГ Курганская
	array(), // Гопники
	array(), // Таксопарк
	array("ГДЗС", "ГДЗС", "МК", "ПСО", "ГПН") // МЧС
);

?>